app/controllers/api/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        incoming_id = params[:id]
        @user = User.find_by(id: incoming_id)